Revit 2027 API
FamilyItemFactory.NewRadialDimension Method
 Creates a new radial dimension object.
Overload List
Name | Description
NewRadialDimension(View, Reference, XYZ) |  Creates a new radial dimension object using the default dimension type.
NewRadialDimension(View, Reference, XYZ, DimensionType) |  Generate a new radial dimension object using a specified dimension type.
Top
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace